package chapter2;

public class notationSample {

	public static void main(String[] args) {
		/*10진수: 사람, 0~9
		 * 2진수: 컴퓨터, 0 or 1(digital)
		 * 근대 컴퓨터의 효시: 폰노이만 => 라이프니쯔 =>  역학(주 문왕)8
		 * 0, 1 => 잔자, 소프트웨어, 통신, ...
		 * 8진수: 2의 3승
		 * 16진법: 2의 4승
		 */
		
	int x = 100; // 10진수
	int y = 0100; //8진수
	int z = 0x100;	//16진수
	
	System.out.println(x);
	System.out.println(y);
	System.out.println(z);
	
	//4byte memory 사용
	/* 100
	 * -------------------------------
	 * 128  64  32  16  8   4   2   1
	 * -------------------------------
	 *  0   1    1  0   0  1  0  0  (2진수)
	 *
	 *	7승	6승	5승	4승	3승	2승	1승	0승
	 *	2^6  2^5          2^2
	 *   64 + 32           4
	 *
	 *8진수 = 8진법
	 *4	2	1	4	2	1	4	2	1
	 *----------------------------------------------
	 *
	 *(2진수) => 4
	 *
	 *	8의 0승:1
	 *	8의 1승:8
	 *	8의 2승:64
	 *	8의 3승:512
	 *
	 *16진수 = 16진법
	 *----------------------------------------------
	 *8	4	2	1	8	4	2	1	8	4	2	1
	 *----------------------------------------------
	 *                  1   0   0	0	1	1	0 => 256
	 *1X16^2 +1X1662 + 1X1661
	 *16의 0승: 1
	 *16의 1승: 16
	 *16의 2승: 256
	 *
	 */
	}

}
